server/performance/health-recommendation-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 20
      arrivalRate: 1
      name: Warm up
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Register, Login and Create Health Profile"
    flow:
      # Step 1: Register a new user
      - post:
          url: "/api/auth/register"
          json:
            firstName: "Performance"
            lastName: "Tester"
            email: "health-test-{{ $randomString(8) }}@example.com"
            password: "password123"
            confirmPassword: "password123"
            phoneNumber: "1234567890"
          capture:
            - json: "$.user.email"
              as: "userEmail"
      
      # Step 2: Login to get token
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ userEmail }}"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      
      # Step 3: Create Health Profile
      - post:
          url: "/api/health-recommendation"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            profile_name: "Stress Test Profile"
            user_profile:
              age: 30
              gender: "female"
              weight_kg: 65
              height_cm: 165
              activity_level: "active"
              dietary_preference: "vegetarian"
              goal: "maintain"